slotburner-fpv-1million/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-0.25 -0.025 0)//0
    (0.25 -0.025 0)//1
    (0.25 0.025 0)//2

    (-0.25 0.025 0)//3
    (-0.25 -0.025 2)//4
    (0.25 -0.025 2)//5
    (0.25 0.025 2)//6
    (-0.25 0.025 2)//7
    (-0.3 -0.075 0) //8
    (-0.25 -0.075 0) //9
    (-0.3 -0.025 0) //10
    (-0.3 0.025 0) //11 
    (-0.25 0.075 0) //12
    (-0.3 0.075 0) //13
    (0.25 -0.075 0) //14
    (0.3 -0.075 0) //15
    (0.3 -0.025 0) //16
    (0.3 0.025 0) //17
    (0.3 0.075 0) //18
    (0.25 0.075 0) //19
    (-0.3 -0.075 2) //20
    (-0.25 -0.075 2) //21
    (-0.3 -0.025 2) //22
    (-0.3 0.025 2) //23 
    (-0.25 0.075 2) //24
    (-0.3 0.075 2) //25
    (0.25 -0.075 2) //26
    (0.3 -0.075 2) //27
    (0.3 -0.025 2) //28
    (0.3 0.025 2) //29
    (0.3 0.075 2) //30
    (0.25 0.075 2) //31
    (-0.375 -0.25 0) //32
    (-0.3 -0.25 0) //33
    (-0.375 -0.075 0)//34
    (-0.375 -0.025 0) //35
    (-0.375 0.025 0) //36
    (-0.375 0.075 0) //37
    (-0.375 0.25 0) //38
    (-0.3 0.25 0) //39
    (-0.25 -0.25 0) //40
    (-0.25 0.25 0) //41
    (0.25 -0.25 0) //42
    (0.3 -0.25 0) //43
    (0.375 -0.25 0) //44
    (0.375 -0.075 0) //45
    (0.375 -0.025 0) // 46
    (0.375 0.025 0) //47
    (0.375 0.075 0) //48
    (0.375 0.25 0) //49
    (0.3 0.25 0) //50
    (0.25 0.25 0) //51
    (-0.375 -0.25 2) //52
    (-0.3 -0.25 2) //53
    (-0.375 -0.075 2)//54
    (-0.375 -0.025 2) //55
    (-0.375 0.025 2) //56
    (-0.375 0.075 2) //57
    (-0.375 0.25 2) //58
    (-0.3 0.25 2) //59
    (-0.25 -0.25 2) //60
    (-0.25 0.25 2) //61
    (0.25 -0.25 2) //62
    (0.3 -0.25 2) //63
    (0.375 -0.25 2) //64
    (0.375 -0.075 2) //65
    (0.375 -0.025 2) // 66
    (0.375 0.025 2) //67
    (0.375 0.075 2) //68
    (0.375 0.25 2) //69
    (0.3 0.25 2) //70
    (0.25 0.25 2) //71
    (-0.475 -0.35 0) //72
    (-0.375 -0.35 0) //73
    (-0.475 -0.25 0) //74
    (-0.475 -0.075 0) //75
    (-0.475 -0.025 0) //76
    (-0.475 0.025 0) //77
    (-0.475 0.075 0) //78
    (-0.475 0.25 0) //79
    (-0.475 0.35 0) //80
    (-0.375 0.35 0) //81
    (-0.3 -0.35 0) // 82
    (-0.3 0.35 0) //83
    (-0.25 -0.35 0) //84
    (-0.25 0.35 0) // 85
    (0.25 -0.35 0) //86
    (0.3 -0.35 0) //87
    (0.375 -0.35 0) //88
    (0.475 -0.35 0) // 89
    (0.475 -0.25 0) //90
    (0.475 -0.075 0) //91
    (0.475 -0.025 0) //92
    (0.475 0.025 0) //93
    (0.475 0.075 0) //94
    (0.475 0.25 0) //95
    (0.475 0.35 0) //96
    (0.375 0.35 0) //97
    (0.3 0.35 0) //98
    (0.25 0.35 0) //99
    (-0.475 -0.35 2) //100
    (-0.375 -0.35 2) //101
    (-0.475 -0.25 2) //102
    (-0.475 -0.075 2) //103
    (-0.475 -0.025 2) //104
    (-0.475 0.025 2) //105
    (-0.475 0.075 2) //106
    (-0.475 0.25 2) //107
    (-0.475 0.35 2) //108
    (-0.375 0.35 2) //109
    (-0.3 -0.35 2) // 110
    (-0.3 0.35 2) //111
    (-0.25 -0.35 2) //112
    (-0.25 0.35 2) // 113
    (0.25 -0.35 2) //114
    (0.3 -0.35 2) //115
    (0.375 -0.35 2) //116
    (0.475 -0.35 2) // 117
    (0.475 -0.25 2) //118
    (0.475 -0.075 2) //119
    (0.475 -0.025 2) //120
    (0.475 0.025 2) //121
    (0.475 0.075 2) //122
    (0.475 0.25 2) //123
    (0.475 0.35 2) //124
    (0.375 0.35 2) //125
    (0.3 0.35 2) //126
    (0.25 0.35 2) //127
    (-1 -1 0) // 128
    (-0.475 -1 0) //129
    (-1 -0.35 0) //130
    (-1 -0.25 0) //131
    (-1 -0.075 0) //132
    (-1 -0.025 0) //133
    (-1 0.025 0) //134
    (-1 0.075 0) //135
    (-1 0.25 0) //136
    (-1 0.35 0) //137
    (-1 1 0) //138
    (-0.475 1 0) //139
    (-0.375 -1 0)// 140
    (-0.375 1 0) //141
    (-0.3 -1 0) //142
    (-0.3 1 0) //143
    (-0.25 -1 0)//144
    (-0.25 1 0) //145
    (0.25 -1 0) //146
    (0.3 -1 0) //147
    (0.375 -1 0) //148
    (0.478 -1 0) //149
    (1 -1 0) // 150
    (1 -0.35 0) //151
    (1 -0.25 0) //152
    (1 -0.075 0) //153
    (1 -0.025 0) //154
    (1 0.025 0) //155
    (1 0.075 0) //156
    (1 0.25 0) //157
    (1 0.35 0) //158
    (1 1 0) //159
    (0.475 1 0) //160
    (0.375 1 0) //161
    (0.3 1 0) //162
    (0.25 1 0) //163
    (-1 -1 2) // 164
    (-0.475 -1 2) //165
    (-1 -0.35 2) //166
    (-1 -0.25 2) //167
    (-1 -0.075 2) //168
    (-1 -0.025 2) //169
    (-1 0.025 2) //170
    (-1 0.075 2) //171
    (-1 0.25 2) //172
    (-1 0.35 2) //173
    (-1 1 2) //174
    (-0.475 1 2) //175
    (-0.375 -1 2)// 176
    (-0.375 1 2) //177
    (-0.3 -1 2) //178
    (-0.3 1 2) //179
    (-0.25 -1 2)//180
    (-0.25 1 2) //181
    (0.25 -1 2) //182
    (0.3 -1 2) //183
    (0.375 -1 2) //184
    (0.478 -1 2) //185
    (1 -1 2) // 186
    (1 -0.35 2) //187
    (1 -0.25 2) //188
    (1 -0.075 2) //189
    (1 -0.025 2) //190
    (1 0.025 2) //191
    (1 0.075 2) //192
    (1 0.25 2) //193
    (1 0.35 2) //194
    (1 1 2) //195
    (0.475 1 2) //196
    (0.375 1 2) //197
    (0.3 1 2) //198
    (0.25 1 2) //199



);

blocks
(
    hex (0 1 2 3 4 5 6 7) (60 6 132) simpleGrading (1 1 3) //block 0
    hex (8 9 0 10 20 21 4 22) (6 6 132) simpleGrading (1 1 3) // block 1
    hex (10 0 3 11 22 4 7 23) (6 6 132) simpleGrading (1 1 3) //blcok 2 
    hex (11 3 12 13 23 7 24 25) (6 6 132) simpleGrading (1 1 3) //blcok 3
    hex (14 15 16 1 26 27 28 5) (6 6 132) simpleGrading (1 1 3) //blcok 4
    hex (1 16 17 2 5 28 29 6) (6 6 132) simpleGrading (1 1 3) //blcok 5
    hex (2 17 18 19 6 29 30 31) (6 6 132) simpleGrading (1 1 3) //blcok 6
    hex (9 14 1 0 21 26 5 4) (60 6 132) simpleGrading (1 1 3) //blcok 7
    hex (3 2 19 12 7 6 31 24) (60 6 132) simpleGrading (1 1 3) //blcok 8
    hex (32 33 8 34 52 53 20 54) (9 21 132) simpleGrading (1 1 3) //blcok 9
    hex (34 8 10 35 54 20 22 55) (9 6 132) simpleGrading (1 1 3) //blcok 10
    hex (35 10 11 36 55 22 23 56) (9 6 132) simpleGrading (1 1 3) //blcok 11
    hex (36 11 13 37 56 23 25 57) (9 6 132) simpleGrading (1 1 3) //blcok 12
    hex (37 13 39 38 57 25 59 58) (9 21 132) simpleGrading (1 1 3) //blcok 13
    hex (33 40 9 8 53 60 21 20) (6 21 132) simpleGrading (1 1 3) //blcok 14
    hex (13 12 41 39 25 24 61 59) (6 21 132) simpleGrading (1 1 3) //blcok 15
    hex (43 44 45 15 63 64 65 27) (9 21 132) simpleGrading (1 1 3) //blcok 16
    hex (15 45 46 16 27 65 66 28) (9 6 132) simpleGrading (1 1 3) //blcok 17
    hex (16 46 47 17 28 66 67 29) (9 6 132) simpleGrading (1 1 3) //blcok 18
    hex (17 47 48 18 29 67 68 30) (9 6 132) simpleGrading (1 1 3) //blcok 19
    hex (18 48 49 50 30 68 69 70) (9 21 132) simpleGrading (1 1 3) //blcok 20
    hex (19 18 50 51 31 30 70 71) (6 21 132) simpleGrading (1 1 3) //blcok 21
    hex (42 43 15 14 62 63 27 26) (6 21 132) simpleGrading (1 1 3) //blcok 22
    hex (40 42 14 9 60 62 26 21) (60 21 132) simpleGrading (1 1 3) //blcok 23
    hex (12 19 51 41 24 31 71 61) (60 21 132) simpleGrading (1 1 3) //blcok 24
    hex (72 73 32 74 100 101 52 102) (8 8 132) simpleGrading (0.5 0.5 3) //blcok 25
    hex (74 32 34 75 102 52 54 103) (8 21 132) simpleGrading (0.5 1 3) //blcok 26
    hex (75 34 35 76 103 54 55 104) (8 6 132) simpleGrading (0.5 1 3) //blcok 27
    hex (76 35 36 77 104 55 56 105) (8 6 132) simpleGrading (0.5 1 3) //block 28
    hex (77 36 37 78 105 56 57 106) (8 6 132) simpleGrading (0.5 1 3) //blcok 29
    hex (78 37 38 79 106 57 58 107) (8 21 132) simpleGrading (0.5 1 3) //blcok 30
    hex (79 38 81 80 107 58 109 108) (8 8 132) simpleGrading (0.5 2 3) //blcok 31
    hex (73 82 33 32 101 110 53 52) (9 8 132) simpleGrading (1 0.5 3) //blcok 32
    hex (38 39 83 81 58 59 111 109) (9 8 132) simpleGrading (1 2 3) //blcok 33
    hex (82 84 40 33 110 112 60 53) (6 8 132) simpleGrading (1 0.5 3) //blcok 34
    hex (39 41 85 83 59 61 113 111) (6 8 132) simpleGrading (1 2 3) //blcok 35
    hex (88 89 90 44 116 117 118 64) (8 8 132) simpleGrading (2 0.5 3) //blcok 36 
    hex (44 90 91 45 64 118 119 65) (8 21 132) simpleGrading (2 1 3) //blcok 37
    hex (45 91 92 46 65 119 120 66) (8 6 132) simpleGrading (2 1 3) //blcok 38
    hex (46 92 93 47 66 120 121 67) (8 6 132) simpleGrading (2 1 3) //block 39
    hex (47 93 94 48 67 121 122 68) (8 6 132) simpleGrading (2 1 3) //blcok 40
    hex (48 94 95 49 68 122 123 69) (8 21 132) simpleGrading (2 1 3) //blcok 41
    hex (49 95 96 97 69 123 124 125) (8 8 132) simpleGrading (2 2 3) //blcok 42
    hex (87 88 44 43 115 116 64 63) (9 8 132) simpleGrading (1 0.5 3) //blcok 43
    hex (50 49 97 98 70 69 125 126) (9 8 132) simpleGrading (1 2 3) //blcok 44
    hex (86 87 43 42 114 115 63 62) (6 8 132) simpleGrading (1 0.5 3) //blcok 45
    hex (51 50 98 99 71 70 126 127) (6 8 132) simpleGrading (1 2 3) //blcok 46
    hex (84 86 42 40 112 114 62 60) (60 8 132) simpleGrading (1 0.5 3) //blcok 47
    hex (41 51 99 85 61 71 127 113) (60 8 132) simpleGrading (1 2 3) //blcok 48
    hex (128 129 72 130 164 165 100 166) (15 18 132) simpleGrading (0.3333 0.3333 3) //blcok 49
    hex (130 72 74 131 166 100 102 167) (15 8 132) simpleGrading (0.3333 0.5 3) //blcok 50
    hex (131 74 75 132 167 102 103 168) (15 21 132) simpleGrading (0.3333 1 3) //blcok 51
    hex (132 75 76 133 168 103 104 169) (15 6 132) simpleGrading (0.3333 1 3) //blcok 52
    hex (133 76 77 134 169 104 105 170) (15 6 132) simpleGrading (0.3333 1 3) //blcok 53
    hex (134 77 78 135 170 105 106 171) (15 6 132) simpleGrading (0.3333 1 3) //blcok 54
    hex (135 78 79 136 171 106 107 172) (15 21 132) simpleGrading (0.3333 1 3) //blcok 55
    hex (136 79 80 137 172 107 108 173) (15 8 132) simpleGrading (0.3333 2 3) //blcok 56
    hex (137 80 139 138 173 108 175 174) (15 18 132) simpleGrading (0.3333 3 3) //blcok 57
    hex (129 140 73 72 165 176 101 100) (8 18 132) simpleGrading (0.5 0.3333 3) //blcok 58
    hex (80 81 141 139 108 109 177 175) (8 18 132) simpleGrading (0.5 3 3) //blcok 59
    hex (140 142 82 73 176 178 110 101) (9 18 132) simpleGrading (1 0.3333 3) //blcok 60
    hex (81 83 143 141 109 111 179 177) (9 18 132) simpleGrading (1 3 3) //blcok 61
    hex (142 144 84 82 178 180 112 110) (6 18 132) simpleGrading (1 0.3333 3) //blcok 62
    hex (83 85 145 143 111 113 181 179) (6 18 132) simpleGrading (1 3 3) //blcok 63
    hex (144 146 86 84 180 182 114 112) (60 18 132) simpleGrading (1 0.3333 3) //blcok 64
    hex (85 99 163 145 113 127 199 181) (60 18 132) simpleGrading (1 3 3) //blcok 65
    hex (146 147 87 86 182 183 115 114) (6 18 132) simpleGrading (1 0.3333 3) //blcok 66
    hex (99 98 162 163 127 126 198 199) (6 18 132) simpleGrading (1 3 3) //blcok 67
    hex (147 148 88 87 183 184 116 115) (9 18 132) simpleGrading (1 0.3333 3) //blcok 68
    hex (98 97 161 162 126 125 197 198) (9 18 132) simpleGrading (1 3 3) //blcok 69
    hex (148 149 89 88 184 185 117 116) (8 18 132) simpleGrading (2 0.3333 3) //blcok 70
    hex (97 96 160 161 125 124 196 197) (8 18 132) simpleGrading (2 3 3) //blcok 71
    hex (149 150 151 89 185 186 187 117) (15 18 132) simpleGrading (3 0.3333 3) //blcok 72
    hex (89 151 152 90 117 187 188 118) (15 8 132) simpleGrading (3 0.5 3) //blcok 73
    hex (90 152 153 91 118 188 189 119) (15 21 132) simpleGrading (3 1 3) //blcok 74
    hex (91 153 154 92 119 189 190 120) (15 6 132) simpleGrading (3 1 3) //blcok 75
    hex (92 154 155 93 120 190 191 121) (15 6 132) simpleGrading (3 1 3) //blcok 76
    hex (93 155 156 94 121 191 192 122) (15 6 132) simpleGrading (3 1 3) //blcok 77
    hex (94 156 157 95 122 192 193 123) (15 21 132) simpleGrading (3 1 3) //blcok 78
    hex (95 157 158 96 123 193 194 124) (15 8 132) simpleGrading (3 2 3) //blcok 79
    hex (96 158 159 160 124 194 195 196) (15 18 132) simpleGrading (3 3 3) //blcok 80


);

edges
(
);
boundary
(
    inletFuel
   {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }
    inletCoflow
   {
        type patch;
        faces
        (
            (32 34 8 33)
       	    (34 35 10 8)
	    (35 36 11 10)
	    (36 37 13 11)
	    (37 38 39 13)
	    (33 8 9 40)
	    (13 39 41 12)
	    (43 15 45 44)
	    (15 16 46 45)
	    (16 17 47 46)
	    (17 18 48 47)
	    (18 50 49 48)
	    (19 51 50 18)
	    (42 14 15 43)
	    (40 9 14 42)
	    (12 41 51 19)
        );
    }
    outlet
    {
        type patch;
	faces
	(
	    (4 5 6 7)
	    (20 21 4 22)
	    (22 4 7 23)
	    (23 7 24 25)
	    (26 27 28 5)
	    (5 28 29 6)
	    (6 29 30 31)
	    (21 26 5 4)
	    (7 6 31 24)
	    (52 53 20 54)
	    (54 20 22 55)
	    (55 22 23 56)
	    (56 23 25 57)
	    (57 25 59 58)
	    (53 60 21 20)
	    (25 24 61 59)
	    (63 64 65 27)
	    (27 65 66 28)
	    (28 66 67 29)
	    (29 67 68 30)
	    (30 68 69 70)
	    (31 30 70 71)
	    (62 63 27 26)
	    (60 62 26 21)
	    (24 31 71 61)
	    (100 101 52 102)
	    (102 52 54 103)
	    (103 54 55 104)
	    (104 55 56 105)
	    (105 56 57 106)
	    (106 57 58 107)
	    (107 58 109 108)
	    (101 110 53 52)
	    (58 59 111 109)
	    (110 112 60 53)
	    (59 61 113 111)
	    (116 117 118 64)
	    (64 118 119 65)
	    (65 119 120 66)
	    (66 120 121 67)
	    (67 121 122 68)
	    (68 122 123 69)
	    (69 123 124 125)
	    (115 116 64 63)
	    (70 69 125 126)
	    (114 115 63 62)
	    (71 70 126 127)
	    (112 114 62 60)
	    (61 71 127 113)
	    (164 165 100 166)
	    (166 100 102 167)
	    (167 102 103 168)
	    (168 103 104 169)
	    (169 104 105 170)
	    (170 105 106 171)
	    (171 106 107 172)
	    (172 107 108 173)
	    (173 108 175 174)
	    (165 176 101 100)
	    (108 109 177 175)
	    (176 178 110 101)
	    (109 111 179 177)
	    (178 180 112 110)	
	    (111 113 181 179)
	    (180 182 114 112)
	    (113 127 199 181)
	    (182 183 115 114)
	    (127 126 198 199)
	    (183 184 116 115)
	    (126 125 197 198)
	    (184 185 117 116)
	    (125 124 196 197)
	    (185 186 187 117)
	    (117 187 188 118)
	    (118 188 189 119)
	    (119 189 190 120)
	    (120 190 191 121)
	    (121 191 192 122)
	    (122 192 193 123)
	    (123 193 194 124)
	    (124 194 195 196)
	);
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (8 10 0 9) // inner frame for fuel flow
            (10 11 3 0)
     	    (11 13 12 3)
	    (14 1 16 15)
	    (1 2 17 16)
	    (2 19 18 17)
	    (9 0 1 14)
	    (3 12 19 2)
  	    (72 74 32 73) //frame for coflow
	    (74 75 34 32)
	    (75 76 35 34)
	    (76 77 36 35)
	    (77 78 37 36)
	    (78 79 38 37)
	    (79 80 81 38)
	    (73 32 33 82)
	    (38 81 83 39)
	    (82 33 40 84)
	    (39 83 85 41)
 	    (88 44 90 89)
	    (44 45 91 90)
	    (45 46 92 91)
	    (46 47 93 92)
	    (47 48 94 93)
	    (48 49 95 94)
	    (49 97 96 95)
	    (87 43 44 88)
	    (50 98 97 49)
	    (86 42 43 87)
	    (51 99 98 50)
	    (84 40 42 86)
	    (41 85 99 51)


        );
    }
    entrainmentBottom
   {
        type patch;
        faces
        (
            (128 130 72 129)
       	    (130 131 74 72)
	    (131 132 75 74)
	    (132 133 76 75)
	    (133 134 77 76)
	    (134 135 78 77)
	    (135 136 79 78)
	    (136 137 80 79)
	    (137 138 139 80)
	    (129 72 73 140)
	    (80 139 141 81)
	    (140 73 82 142)
	    (81 141 143 83)
	    (142 82 84 144)
	    (83 143 145 85)
	    (144 84 86 146)
	    (85 145 163 99)
	    (146 86 87 147)
	    (99 163 162 98)
	    (147 87 88 148)
	    (98 162 161 97)
	    (148 88 89 149)
	    (97 161 160 96)
	    (149 89 151 150)
	    (89 90 152 151)
	    (90 91 153 152)
	    (91 92 154 153)
	    (92 93 155 154)
	    (93 94 156 155)
	    (94 95 157 156)
	    (95 96 158 157)
	    (96 160 159 158)
        );
    }
    entrainmentWestSide
   {
        type patch;
        faces
        (
	    (128 164 166 130)
	    (130 166 167 131)
	    (131 167 168 132)
	    (132 168 169 133)
	    (133 169 170 134)
	    (134 170 171 135)
	    (135 171 172 136)
	    (136 172 173 137)
	    (137 173 174 138) 
        );
    }
    entrainmentNorthSide
   {
        type patch;
        faces
        (
	    (138 174 175 139)
   	    (139 175 177 141)  
	    (141 177 179 143)
	    (143 179 181 145)
	    (145 181 199 163)
	    (163 199 198 162)
	    (162 198 197 161)
	    (161 197 196 160)
	    (160 196 195 159)
        );
    }
    entrainmentEastSide
   {
        type patch;
        faces
        (
	    (159 195 194 158)
	    (158 194 193 157)
	    (157 193 192 156)
	    (156 192 191 155)
	    (155 191 190 154)
	    (154 190 189 153)
	    (153 189 188 152)
	    (152 188 187 151)
	    (151 187 186 150) 
        );
    }
    entrainmentSouthSide
   {
        type patch;
        faces
        (
	    (150 186 185 149)
	    (149 185 184 148)
	    (148 184 183 147)
	    (147 183 182 146)
	    (146 182 180 144)
	    (144 180 178 142)
	    (142 178 176 140)
	    (140 176 165 129)
	    (129 165 164 128) 
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
