slotburner-fpv-1million/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    outlet
    {
        type            zeroGradient;
    }

    fixedWalls
    {
        type            zeroGradient;
    }

    inletFuel
    {
        type            fixedValue;
        value           uniform 300;
    }

    inletCoflow
    {
        type            fixedValue;
        value           uniform 300;
    }

    entrainmentBottom
    {
        type            zeroGradient;
    }

    entrainmentWestSide
    {
        type            zeroGradient;
    }

    entrainmentNorthSide
    {
        type            zeroGradient;
    }
    entrainmentEastSide
    {
        type            zeroGradient;
    }
    entrainmentSouthSide
    {
        type            zeroGradient;
    }

}


// ************************************************************************* //
