slotburner-fpv-1million/0/alphaSgs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphaSgs;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    "(outlet|entrainmentBottom|entrainmentWestSide|entrainmentNorthSide|entrainmentEastSide|entrainmentSouthSide)"
    {
    	type		calculated;
	value		uniform 0;
    }

    inletCoflow
    {
    	type		calculated;
	value		uniform 0;
    }

    inletFuel
    {
    	type		calculated;
	value		uniform 0;
    }


    fixedWalls
    {
    	type		zeroGradient;
    }



}


// ************************************************************************* //
